{
  "Nickname": "Ba2Repacker-dev",
  "Visibility": "Visible",
  "OneLineDescription": "Automatically Repack small BA2s into one",
  "LongDescription": "WARNING: This patcher is a beta at best. Expect bugs up to and including loss of BA2 files!\r\nUse at your own risk!\r\n\r\nCombines several smaller BA2s into one large one, as a workaround for the BA2 limit.\r\nBA2s get chosen for repacking by file size (smallest first). \r\nFiles which were used for repacking are renamed to \".repacked\" (configurable). \r\nThis gets reversed before the next run.\r\n\r\nVanilla files are NEVER repacked. For CreationClub mods, this can be enabled via the settings.\r\n\r\nSettings explanation:\r\n\r\n- Main BA2 Limit:\r\n The patcher will add up all currently installed non-texture BA2s, master files, ESLs, as well as CDX and CSG files.\r\n If that number is higher than the setting \"Main BA2 Limit\", main BA2s will be precombined to get below it again.\r\n\r\n- Texture BA2 Limit:\r\n Texture BA2s seem to have a different limit, and causes visual issues in-game, instead of a crash after the intro.\r\n For this limit, only the Texture BA2s are counted and must be below the configured number.\r\n\r\n- Maximal Filesize (MB):\r\n BA2s above this size will never be repacked\r\n\r\n- Exclude CreationClub Mods:\r\n CC mods can have their BA2s restored, when you revalidate files via Steam. For this reason, they are excluded by default.\r\n Disabling this option will allow the patcher to repack them as well.\r\n\r\n- Whitelist Mode\r\n In whitelist mode, only mods specified below can have their BA2s repacked, and nothing else.\r\n Otherwise, all mods except the ones specified in the blacklist below are.\r\n Keep in mind that vanilla files are NEVER repacked, no matter the lists, and the setting \"Exclude CreationClub Mods\" trumps whitelisting.\r\n\r\n- Disabled BA2 suffix\r\n When a BA2 was used for repacking, this will be added to it's filename. \r\n \r\n- MO2 Settings:\r\n - Use MO2 mode, if possible: \r\n  If enabled, the patcher will try to detect whenever it is being run through MO2, and switch to MO2 mode if necessary.\r\n  MO2 mode means, the patcher will attempt to make sure that repacked BA2s stay within the proper MO2 mod subfolder,\r\n  otherwise, they will all end up in Overwrite.\r\n  This should now work with both regular and portable installations.\r\n - Override MO2 Profile Name:\r\n  If left empty, the patcher will try to read the current MO2 profile from the config files.\r\n  Otherwise, this profile will be used",
  "PreferredAutoVersioning": "Default",
  "RequiredMods": [],
  "TargetedReleases": [
    "Fallout4"
  ]
}